#include <stdio.h>
// 4.	Тепер додайте оголошення великого масиву в локальну функцію.
// Оголосіть другий великий локальний масив з ініціалізатором. Повторіть вимірювання.
// Дані розташовуються всередині функцій, залишаючись у виконуваному файлі? Яка різниця, якщо масив ініціалізований чи ні?

void func()
{
	int uninizialized_array[1000];
	int inizialized_array[1000] = {1};
}

int main()
{
	printf("Hello world!\n");
	return 0;
}

// 5.	Які зміни відбуваються з розмірами файлів і сегментів, якщо ви компілюєте для налагодження? Для максимальної оптимізації?
// Проаналізуйте результати, щоб переконатися, що:
// ●	сегмент даних зберігається у виконуваному файлі;
// ●	сегмент BSS не зберігається у виконуваному файлі (за винятком примітки щодо його вимог до розміру часу виконання);
// ●	текстовий сегмент більшою мірою піддається перевіркам оптимізації;
// ●	на розмір файлу a.out впливає компіляція для налагодження, але не сегменти.
